**** preferred sequence for loading apollo and other incarnation samples
:PROPERTIES:
:ID:       62220D41-AE0A-4D5F-B2D6-6B100610A89B
:END:
#+BEGIN_SRC clojure :results silent

(def path-to-sounds "/Applications/SuperCollider/SuperCollider.app/Contents/Resources/")
(def path-to-mono (str path-to-sounds "sounds/all-mono/"))
#+END_SRC

#+BEGIN_SRC clojure
  (def variation1 (load-sample (str path-to-mono "apollo-variation1-mono.wav")))
  (def variation2 (load-sample (str path-to-mono "apollo-variation2-mono.wav")))
  (def apotheose (load-sample (str path-to-mono "apotheose-mono.wav")))
  (def calliope (load-sample (str path-to-mono "calliope-mono.wav")))
  (def coda (load-sample (str path-to-mono "coda-mono.wav")))
  (def yancey  (load-sample (str path-to-mono "how-long-slowest-mono.wav")))
  (def naissance (load-sample (str path-to-mono "naissance-mono.wav")))
  (def pas-daction (load-sample (str path-to-mono "pas-daction-real-mono.wav")))
  (def pas-deux (load-sample (str path-to-mono "pas-de-deux-mono1.wav")))
  (def polymnie (load-sample (str path-to-mono "polymnie-mono.wav")))
  (def terpsichore (load-sample (str path-to-mono "terpsichore-mono.wav")))
  ;; not in all-mono dir?
  (def goldberg-slow (load-sample "~/Google Drive/Audio_uploads/wav-file-uploads/goldberg-slow-mono.wav"))
  (def irma (load-sample (str path-to-sounds "sounds/full-time-mono.wav")))


#+END_SRC

#+RESULTS:
: #'user/variation1#'user/variation2#'user/apotheose#'user/calliope#'user/coda#'user/yancey#'user/naissance#'user/pas-daction#'user/pas-deux#'user/polymnie#'user/terpsichore#'user/goldberg-slow#'user/irma


**** buffer id
#+BEGIN_SRC clojure 
(buffer-id variation1)
(buffer-id variation2)
(buffer-id apotheose)
(buffer-id calliope)
(buffer-id coda)
(buffer-id yancey)
(buffer-id naissance)
(buffer-id pas-daction)
(buffer-id pas-deux)
(buffer-id polymnie)
(buffer-id terpsichore)
(buffer-id goldberg-slow)
(buffer-id irma)
#+END_SRC

#+RESULTS:
: 123456789101112


**** [#A] full info
#+BEGIN_SRC clojure :results output
(for [name [variation1 variation2 apotheose calliope coda yancey naissance pas-daction pas-deux polymnie terpsichore goldberg-slow irma]]
(do  (pprint name) (println)))
#+END_SRC

#+RESULTS:
#+begin_example
{:id 1,
 :size 7658496,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@4bd2aa6c: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/apollo-variation1-mono.wav",
 :args {},
 :name "apollo-variation1-mono.wav",
 :rate-scale 1.0,
 :duration 173.66204081632654,
 :n-samples 7658496}

{:id 2,
 :size 7216896,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@608be141: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/apollo-variation2-mono.wav",
 :args {},
 :name "apollo-variation2-mono.wav",
 :rate-scale 1.0,
 :duration 163.64843537414967,
 :n-samples 7216896}

{:id 3,
 :size 8620032,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@4d530c8a: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/apotheose-mono.wav",
 :args {},
 :name "apotheose-mono.wav",
 :rate-scale 1.0,
 :duration 195.4655782312925,
 :n-samples 8620032}

{:id 4,
 :size 4876288,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@142fc985: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/calliope-mono.wav",
 :args {},
 :name "calliope-mono.wav",
 :rate-scale 1.0,
 :duration 110.57342403628118,
 :n-samples 4876288}

{:id 5,
 :size 7805824,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@3ad9b505: :live>,
 :path "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/coda-mono.wav",
 :args {},
 :name "coda-mono.wav",
 :rate-scale 1.0,
 :duration 177.0028117913832,
 :n-samples 7805824}

{:id 6,
 :size 12036573,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@135beb7c: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/how-long-slowest-mono.wav",
 :args {},
 :name "how-long-slowest-mono.wav",
 :rate-scale 1.0,
 :duration 272.9381632653061,
 :n-samples 12036573}

{:id 7,
 :size 12697600,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@57f1c1d: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/naissance-mono.wav",
 :args {},
 :name "naissance-mono.wav",
 :rate-scale 1.0,
 :duration 287.9274376417234,
 :n-samples 12697600}

{:id 8,
 :size 12649472,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@34c40340: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/pas-daction-real-mono.wav",
 :args {},
 :name "pas-daction-real-mono.wav",
 :rate-scale 1.0,
 :duration 286.8360997732426,
 :n-samples 12649472}

{:id 9,
 :size 10633344,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@1216892f: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/pas-de-deux-mono1.wav",
 :args {},
 :name "pas-de-deux-mono1.wav",
 :rate-scale 1.0,
 :duration 241.11891156462585,
 :n-samples 10633344}

{:id 10,
 :size 3202816,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@1e768dc8: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/polymnie-mono.wav",
 :args {},
 :name "polymnie-mono.wav",
 :rate-scale 1.0,
 :duration 72.62621315192743,
 :n-samples 3202816}

{:id 11,
 :size 5381632,
 :n-channels 2,
 :rate 44100.0,
 :status #<Atom@68de4551: :live>,
 :path
 "/Users/b/Dropbox/AB-local/sc-sounds/all-mono/terpsichore-mono.wav",
 :args {},
 :name "terpsichore-mono.wav",
 :rate-scale 1.0,
 :duration 122.03247165532879,
 :n-samples 10763264}

{:id 12,
 :size 8138240,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@4446018d: :live>,
 :path
 "/Users/b/Google Drive/Audio_uploads/wav-file-uploads/goldberg-slow-mono.wav",
 :args {},
 :name "goldberg-slow-mono.wav",
 :rate-scale 1.0,
 :duration 184.540589569161,
 :n-samples 8138240}

{:id 13,
 :size 7564032,
 :n-channels 1,
 :rate 44100.0,
 :status #<Atom@5531d516: :live>,
 :path "/Users/b/Dropbox/AB-local/sc-sounds/full-time-mono.wav",
 :args {},
 :name "full-time-mono.wav",
 :rate-scale 1.0,
 :duration 171.52,
 :n-samples 7564032}

#+end_example


**** basic buffer-info                                       :buffer:info:
#+BEGIN_SRC clojure :results output
  (for [name [variation1 variation2 apotheose calliope coda yancey naissance pas-daction pas-deux polymnie terpsichore goldberg-slow irma]]
  (do  (pprint (buffer-info name)) (println name) (println)))

  ;; (buffer-info variation1)
  ;; (buffer-info variation2)
  ;; (buffer-info apotheose)
  ;; (buffer-info calliope)
  ;; (buffer-info coda)
  ;; (buffer-info yancey)
  ;; (buffer-info naissance)
  ;; (buffer-info pas-daction)
  ;; (buffer-info pas-deux)
  ;; (buffer-info polymnie)
  ;; (buffer-info terpsichore)

#+END_SRC

#+RESULTS:
#+begin_example
{:id 0,
 :size 7658496,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 7658496,
 :rate-scale 1.0,
 :duration 173.66204081632654}
#<buffer[live]: apollo-variation1-mono.wav 173.662041s mono 0>

{:id 1,
 :size 7216896,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 7216896,
 :rate-scale 1.0,
 :duration 163.64843537414967}
#<buffer[live]: apollo-variation2-mono.wav 163.648435s mono 1>

{:id 2,
 :size 8620032,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 8620032,
 :rate-scale 1.0,
 :duration 195.4655782312925}
#<buffer[live]: apotheose-mono.wav 195.465578s mono 2>

{:id 3,
 :size 4876288,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 4876288,
 :rate-scale 1.0,
 :duration 110.57342403628118}
#<buffer[live]: calliope-mono.wav 110.573424s mono 3>

{:id 4,
 :size 7805824,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 7805824,
 :rate-scale 1.0,
 :duration 177.0028117913832}
#<buffer[live]: coda-mono.wav 177.002812s mono 4>

{:id 5,
 :size 12036573,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 12036573,
 :rate-scale 1.0,
 :duration 272.9381632653061}
#<buffer[live]: how-long-slowest-mono.wav 272.938163s mono 5>

{:id 6,
 :size 12697600,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 12697600,
 :rate-scale 1.0,
 :duration 287.9274376417234}
#<buffer[live]: naissance-mono.wav 287.927438s mono 6>

{:id 7,
 :size 12649472,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 12649472,
 :rate-scale 1.0,
 :duration 286.8360997732426}
#<buffer[live]: pas-daction-real-mono.wav 286.836100s mono 7>

{:id 8,
 :size 10633344,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 10633344,
 :rate-scale 1.0,
 :duration 241.11891156462585}
#<buffer[live]: pas-de-deux-mono1.wav 241.118912s mono 8>

{:id 9,
 :size 3202816,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 3202816,
 :rate-scale 1.0,
 :duration 72.62621315192743}
#<buffer[live]: polymnie-mono.wav 72.626213s mono 9>

{:id 10,
 :size 5381632,
 :n-channels 2,
 :rate 44100.0,
 :n-samples 10763264,
 :rate-scale 1.0,
 :duration 122.03247165532879}
#<buffer[live]: terpsichore-mono.wav 122.032472s stereo 10>

{:id 11,
 :size 8138240,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 8138240,
 :rate-scale 1.0,
 :duration 184.540589569161}
#<buffer[live]: goldberg-slow-mono.wav 184.540590s mono 11>

{:id 12,
 :size 7564032,
 :n-channels 1,
 :rate 44100.0,
 :n-samples 7564032,
 :rate-scale 1.0,
 :duration 171.52}
#<buffer[live]: full-time-mono.wav 171.520000s mono 12>

#+end_example


** monitor current state of refs
:PROPERTIES:
:ID:       119605DE-9AD4-4818-B921-3E6B76396D6C
:END:
#+BEGIN_SRC clojure
  (list 'Channel-one
        'KNOBS @cc1-1 @cc2-1 @cc3-1 @cc4-1 @cc5-1 @cc6-1 @cc7-1 @cc8-1
        'PADS @pad1-1 @pad2-1 @pad3-1 @pad4-1 @pad5-1 @pad6-1 @pad7-1 @pad8-1
        'Channel-two
        'KNOBS
        @cc1-2 @cc2-2 @cc3-2 @cc4-2 @cc5-2 @cc6-2 @cc7-2 @cc8-2
        'PADS @pad1-2 @pad2-2 @pad3-2 @pad4-2 @pad5-2 @pad6-2 @pad7-2 @pad8-2)
#+END_SRC

#+RESULTS:
| Channel-one | KNOBS | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | PADS | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | Channel-two | KNOBS | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | PADS | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |


** full knob and pad abstraction
:PROPERTIES:
:ID:       C945047A-E0FD-439C-9354-6F8CA4989DAE
:END:
#+BEGIN_SRC clojure
;;; N.B. passing in the buffer num isn't ideal!
  (defn reset-knob [synth buffer-num synth-param knob-number place midi-channel & {:keys [scale]
                                                                        :or {scale 1}}]
      (fn [{knob :note val :velocity chan :channel}]
        (if (= chan midi-channel)
          (cond (= knob knob-number)
                (do (reset! place (* val scale))
                    (ctl synth (keyword buffer) buffer-num (keyword synth-param) (deref place))
                    (println (str synth-param knob-number " : ") (deref place)))))))

#+END_SRC

#+RESULTS:
: #'user/reset-knob

#+BEGIN_SRC clojure
;;; N.B. passing in the buffer num isn't ideal!
  (defn swap-pad [synth buffer-num synth-param pad-number place swap-fn midi-channel]
      (fn [{pad :note val :velocity chan :channel}]
        (if (= chan midi-channel)
          (cond (= pad pad-number)
                (do (swap! place swap-fn)
                    (ctl synth (keyword buffer) buffer-num (keyword synth-param) (deref place))
                    (println (str synth-param pad-number " : ") (deref place)))))))
    
#+END_SRC

#+RESULTS:
: #'user/swap-pad


** check loaded buffers for incarnation

[[id:19C65970-C333-4D09-AD7B-31C158D9C120][make sure buffer was loaded]] as above

#+RESULTS:

Basic playback of a loaded buffer

#+BEGIN_SRC clojure :results silent
(definst playback-buf [bufname 0] (play-buf 1 bufname))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(playback-buf yancey)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(playback-buf goldberg-slow)
#+END_SRC

#+BEGIN_SRC clojure
(buffer-info goldberg-slow)
#+END_SRC

#+RESULTS:
: #<buffer-info: 184.540590s mono 0>

#+BEGIN_SRC clojure
(buffer-info yancey)
#+END_SRC

#+RESULTS:
: #<buffer-info: 272.938163s mono 1>


** [#B] a start (too large)

#+BEGIN_SRC clojure
  (use 'overtone.live)




  (def goldberg-slow (load-sample "/Users/b/Google Drive/Audio_uploads/wav-file-uploads/goldberg-slow-mono.wav"))

  (def yancey (load-sample "/Applications/SuperCollider/SuperCollider.app/Contents/Resources/sounds/all-mono/how-long-slowest-mono.wav"))


  (definst general-tgrains [buffer 0 trate 1 dur-numerator 8 amp 0.8 centerpos 0]
    (let [trate trate
          dur (/ dur-numerator trate)
          clk (impulse:ar trate)
          centerpos centerpos]
      (t-grains:ar 1 clk buffer 1 centerpos dur 0 amp 2)))


  (def cc1-1 (atom 0))
  (def cc2-1 (atom 0))
  (def cc3-1 (atom 0))
  (def cc4-1 (atom 0))
  (def cc5-1 (atom 0))
  (def cc6-1 (atom 0))
  (def cc7-1 (atom 0))
  (def cc8-1 (atom 0))
  (def cc1-2 (atom 0))
  (def cc2-2 (atom 0))
  (def cc3-2 (atom 0))
  (def cc4-2 (atom 0))
  (def cc5-2 (atom 0))
  (def cc6-2 (atom 0))
  (def cc7-2 (atom 0))
  (def cc8-2 (atom 0))

  (def pad1-1 (atom 0))
  (def pad2-1 (atom 0))
  (def pad3-1 (atom 0))
  (def pad4-1 (atom 0))
  (def pad5-1 (atom 0))
  (def pad6-1 (atom 0))
  (def pad7-1 (atom 0))
  (def pad8-1 (atom 0))
  (def pad1-2 (atom 0))
  (def pad2-2 (atom 0))
  (def pad3-2 (atom 0))
  (def pad4-2 (atom 0))
  (def pad5-2 (atom 0))
  (def pad6-2 (atom 0))
  (def pad7-2 (atom 0))
  (def pad8-2 (atom 0))

#+END_SRC

#+RESULTS:
: nil({:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x532c970a "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x5762a89f "com.sun.media.sound.MidiInDevice@5762a89f"], :version "Unknown version"} {:description "Axiom A.I.R. Mini32 HyperControl", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "HyperControl", :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "HyperControl" "Axiom A.I.R. Mini32 HyperControl" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x43848397 "HyperControl"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x264f265d "com.sun.media.sound.MidiInDevice@264f265d"], :version "Unknown version"})#'user/goldberg-slow#'user/yancey#<instrument: general-tgrains>#'user/cc1-1#'user/cc2-1#'user/cc3-1#'user/cc4-1#'user/cc5-1#'user/cc6-1#'user/cc7-1#'user/cc8-1#'user/cc1-2#'user/cc2-2#'user/cc3-2#'user/cc4-2#'user/cc5-2#'user/cc6-2#'user/cc7-2#'user/cc8-2#'user/pad1-1#'user/pad2-1#'user/pad3-1#'user/pad4-1#'user/pad5-1#'user/pad6-1#'user/pad7-1#'user/pad8-1#'user/pad1-2#'user/pad2-2#'user/pad3-2#'user/pad4-2#'user/pad5-2#'user/pad6-2#'user/pad7-2#'user/pad8-2

#+BEGIN_SRC clojure
    (defn reset-knob [synth synth-param knob-number place midi-channel & {:keys [scale]
                                                                          :or {scale 1}}]
        (fn [{knob :note val :velocity chan :channel}]
          (if (= chan midi-channel)
            (cond (= knob knob-number)
                  (do (reset! place (* val scale))
                      (ctl synth (keyword synth-param) (deref place))
                      (println (str synth-param knob-number " : ") (deref place)))))))




    (defn swap-pad [synth synth-param pad-number place swap-fn midi-channel]
        (fn [{pad :note val :velocity chan :channel}]
          (if (= chan midi-channel)
            (cond (= pad pad-number)
                  (do (swap! place swap-fn)
                      (ctl synth (keyword synth-param) (deref place))
                      (println (str synth-param pad-number " : ") (deref place)))))))
    


    (on-event [:midi :control-change]
              (reset-knob general-tgrains :buffer 0 :amp 2 cc2-1 1 :scale 0.01)
              ::amp-knob2)

    (on-event [:midi :control-change]
              (reset-knob general-tgrains :buffer 0 :centerpos 1 cc1-1 1 :scale 0.5)
              ::centerpos-knob1)


    (on-event [:midi :note-on]
              (swap-pad general-tgrains :buffer 0 :centerpos 38 pad3-1 inc 1)
              ::centerpos-pad3-inc)

    (on-event [:midi :note-on]
              (swap-pad general-tgrains :buffer 0 :centerpos 39 pad3-1 dec 1)
              ::centerpos-pad4-dec)

    (on-event [:midi :note-on]
              (swap-pad general-tgrains :buffer 0 :dur-numerator 36 pad1-1 inc 1)
              ::durnumerator-pad1)

    (on-event [:midi :note-on]
              (swap-pad general-tgrains :buffer 0 :dur-numerator 37 pad1-1 dec 1)
              ::durnumerator-pad2)

  (on-event [:midi :note-on]
              (swap-pad general-tgrains :buffer 0 :trate 42 pad7-1 (fn [x] (+ 0.1 x)) 1)
              ::trate-pad7-inc)

    (on-event [:midi :note-on]
              (swap-pad general-tgrains :buffer 0 :trate 43 pad7-1 (fn [x] (- x 0.1)) 1)
              ::trate-pad8-dec)


    (on-event [:midi :control-change]
              (reset-knob general-tgrains :buffer 1 :amp 2 :place cc2-2 :midi-channel 2 :scale 0.01)
              ::yancey-amp-knob2)

    (on-event [:midi :control-change]
              (reset-knob general-tgrains :buffer 1 :centerpos 1 cc1-2 2 :scale 0.5)
              ::yancey-centerpos-knob1)
#+END_SRC

#+RESULTS:
: ({:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x5386ff43 "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x7bf18b15 "com.sun.media.sound.MidiInDevice@7bf18b15"], :version "Unknown version"} {:description "Axiom A.I.R. Mini32 HyperControl", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "HyperControl", :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "HyperControl" "Axiom A.I.R. Mini32 HyperControl" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x77743fc8 "HyperControl"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x68bfe7ec "com.sun.media.sound.MidiInDevice@68bfe7ec"], :version "Unknown version"})#'user/goldberg-slow#'user/yancey#<instrument: general-tgrains>#'user/cc1-1#'user/cc2-1#'user/cc3-1#'user/cc4-1#'user/cc5-1#'user/cc6-1#'user/cc7-1#'user/cc8-1#'user/cc1-2#'user/cc2-2#'user/cc3-2#'user/cc4-2#'user/cc5-2#'user/cc6-2#'user/cc7-2#'user/cc8-2#'user/pad1-1#'user/pad2-1#'user/pad3-1#'user/pad4-1#'user/pad5-1#'user/pad6-1#'user/pad7-1#'user/pad8-1#'user/pad1-2#'user/pad2-2#'user/pad3-2#'user/pad4-2#'user/pad5-2#'user/pad6-2#'user/pad7-2#'user/pad8-2#'user/reset-knob#'user/swap-pad:added-async-handler:added-async-handler:added-async-handler:added-async-handler

